// Hitting the jackpot

// შექმენით ფუნქცია რომელიც იღებს მასივს

// -->input: array,ნებიმისერი ტიპის
// processing new Set მეთოდი, filter,

const testJackpot = (jackpot) => {
  const checkingSet = [...new Set(jackpot)];
  return checkingSet.length === 1 ? true : false;
  // თუ სეტის რაოდენობა იქნება 1 ანუ ნიშნავს რომ ეს არის უნიკალური იდენტიფიკატორებით შემადგენეელი მასივი
  // რადგანროცა უნიკალურებია ეს 1 ელემენტად  კვეცავს ყველას  და ელემენტების რაოდენობაც არის 1,მარა თუ სხვადასხვაებია,მაშინ უკვე 2
  //   ან მეტია მაშინ ანუ დუბლირებული იყო
};

console.log(testJackpot(["@", "@", "@", "@"]));

// -->ouput-->true თუ ყველა ელემენტი არისიდენტური, და falseთუ არ არის ყველა იდენტური
